console.log ('number' + 3 + 3); // number33 - відбувається конкатенація, тобто склеювання, так як перше значення це string, а решту 2 це numbers, то всі значення приводяться до одного типу рядкового. /*

console.log (null + 3); // 3 - в даному випадку Null прирівнюється до числа 0 та виконується дія додавання.

console.log (5 && "qwerty");   // qwerty - так як обидва значення True, виводиться останнє. Якби перше значення було False (наприклад 0 замість 5), то вивівся би 0. Тобто якщо перше значення False, далі дії не виконуються і виводиться перше значення. Якщо обидва значення True,  то виводиться друге значення. /*

console.log (+'40' + +'2' + "hillel"); // 42hillel - унарний плюс перетворює тип даних рядковий на числовий, і виконується дія додавання двох чисел. Далі відбувається склеювання (конкатенація) значень, так як одне з них число, а інше рядок. /*

console.log ('10' - 5 === 6); // False - рядкове значення перетворюється на числове і виконується дія віднімання. Далі виконується порівняння двох чисел та типів даних - хоча обидва числа, але 5 не дорівнює 6.

console.log (true + false); // 1 - булеве значення true прирівнюється до 1, а false до 0. Відповідно 1+0=1.

console.log ('4px' - 3); // NaN - перше значення неможливо перетворити в число, так як воно місить буквенні символи, тому операція віднімання не є можливою.

console.log ('4' - 3);  // 1 - перше рядкове значення перетворилося в число і виконалася дія віднімання.

console.log ('6' + 3 ** 0); // 61 - спочатку виконується дія піднесення у степінь (тобто те що справа), а потім відбувається конкатенація, так як це різні типи даних - число і рядок.

console.log (console.log (12 / '6')); // 2 - дія діленнч перетворює рядок на число.

console.log ('10' + (5 === 6)); //10false - 5 не дорівнює 6, тому виведеться false. Так як 10 це рядок відбувається конкатенація, і false також перетворюється в рядок.

console.log (null == ''); // false - Значення null дорівнює лише undefined.

console.log (3 ** (9 / 3)); // 27 - спочатку виконується дія ділення (те, що правочуч), потім дія піднесення у степінь.

console.log (!!'false' == !!'true'); // true - рядкові значення перетворюються в булеві, тобто обидва будуть true і виконується порівняння.

console.log (0 || '0' && 1); // 1 - спочатку виконується дія AND, так як обидва значення істинні, то виводиться друге (1). Далі виконується дія OR: 0 - хибне, тому відповідь 1.

console.log ((+null == false) < 1); // false - Null перетворилося в число 0,  false в числовому вираженні також 0 - тому тут буде True. True приводисться в свою чергу до 1, відповідно 1<1 - false.

console.log (false && true || true); // true - спочатку виконується дія AND, результат якої false (перше хибне значення). Далі виконується OR - результат, якої True, так як вона повертає перше істинне значення.

console.log (false && (false || true)); // false - перша дія OR в результаті дає true (перше істинне значення), далі виконується дія AND, яка виводить перше хибне значення.

console.log ((+null == false) < 1 ** 5); // false - Null перетворилося в число 0, false в числовому вираженні також 0 - тому тут буде True. True в числовому еквіваленті 1. 1 в 5 степені це 1. Тому одежуємо 1<1 - false.
